---
type: MEPCurveType
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# MEPCurveType

`Autodesk.Revit.DB.MEPCurveType` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Cross | — | `public FamilySymbol Cross { get ; set ; }` |
| Property | Elbow | — | `public FamilySymbol Elbow { get ; set ; }` |
| Property | MultiShapeTransition | — | `public FamilySymbol MultiShapeTransition { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PreferredJunctionType | — | `public JunctionType PreferredJunctionType { get ; set ; }` |
| Property | Roughness | — | `public double Roughness { get ; set ; }` |
| Property | RoutingPreferenceManager | 2013 | `public RoutingPreferenceManager RoutingPreferenceManager { get ; }` |
| Property | Shape | 2019 | `public ConnectorProfileType Shape { get ; }` |
| Property | Tap | — | `public FamilySymbol Tap { get ; set ; }` |
| Property | Tee | — | `public FamilySymbol Tee { get ; set ; }` |
| Property | Transition | — | `public FamilySymbol Transition { get ; set ; }` |
| Property | Union | — | `public FamilySymbol Union { get ; set ; }` |